{
    "home": "Accueil",
    "about_us": "À Propos de Nous",
    "our_missions": "Nos Missions",
    "donation": "Don",
    "contact_us": "Contactez-Nous",
    "welcome": "Bienvenue, ",
    "my_profile": "Mon Profil",
    "events": "Événements",
    "tickets": "Billets",
    "warehouses": "Entrepôts",
    "events_add": "Ajouter un Événement",
    "admin_panel": "Panneau Administratif",
    "logout": "Déconnexion",
    "join_us": "Rejoignez-Nous",
    "log_in": "Se Connecter",
    "main_title": "No More Wast",
    "main_subtitle": "La plus grande association de soutien alimentaire et éducatif de France.",
    "username": "Nom d'utilisateur",
    "password": "Mot de passe",
    "login_failed": "Échec de la connexion. Veuillez réessayer.",
    "email": "Email",
    "phone": "Téléphone",
    "name": "Prénom",
    "last_name": "Nom de Famille",
    "postal_address": "Adresse Postale",
    "password_mismatch": "Les mots de passe ne correspondent pas",
    "gender": "Votre genre",
    "man": "Homme",
    "woman": "Femme",
    "registration_failed": "Échec de l'inscription.",
    "about_us_title": "À Propos de Nous - No More Wast",
    "our_mission": "Notre Mission",
    "mission_description": "No More Wast est une organisation dédiée à fournir un soutien essentiel aux personnes dans le besoin. Nous nous engageons principalement dans l'aide alimentaire, en offrant des repas nutritifs et des provisions aux familles et individus en difficulté. De plus, nous proposons divers services communautaires tels que l'aide aux devoirs pour les enfants et le soutien aux personnes âgées et vulnérables.",
    "main_activities": "Nos Activités Principales",
    "activities_description": "Notre action se concentre sur deux grands domaines : l'aide alimentaire et l'assistance personnelle. Chaque semaine, nous organisons des distributions alimentaires pour veiller à ce que personne dans notre communauté ne souffre de la faim. Nos bénévoles dévoués travaillent sans relâche pour collecter, préparer et distribuer des repas sains.",
    "education_support": "Simultanément, nous proposons un service d'aide aux devoirs pour les enfants et les adolescents. Nos bénévoles qualifiés aident les élèves à surmonter leurs difficultés académiques, les guidant dans leurs études et les aidant à atteindre leur potentiel académique. Nous croyons fermement que l'éducation est la clé d'un avenir meilleur.",
    "personal_support": "Soutien Personnel",
    "support_description": "Au-delà de l'aide alimentaire et éducative, nous nous efforçons de soutenir les personnes âgées et les individus en situation de vulnérabilité. Nos bénévoles offrent des services de visites à domicile, d'assistance pour les courses et de soutien administratif. Ces services visent à briser l'isolement social et à fournir une aide pratique dans la vie quotidienne.",
    "our_impact": "Notre Impact",
    "impact_description": "Depuis notre création, No More Wast a touché la vie de nombreuses personnes dans notre communauté. Grâce à nos efforts conjoints, nous avons réussi à distribuer des milliers de repas, à fournir un soutien académique à des centaines d'enfants, et à aider de nombreuses personnes à maintenir leur autonomie et leur dignité.",
    "annual_events": "Chaque année, nous organisons des événements spéciaux pour sensibiliser à la précarité et recueillir des fonds pour soutenir nos initiatives. La générosité de nos donateurs et l'engagement de nos bénévoles sont au cœur de notre succès et nous permettent de poursuivre notre mission.",
    "join_us_description": "Si vous partagez notre vision et souhaitez contribuer à un monde meilleur, nous vous invitons à rejoindre notre communauté de bénévoles. Que vous ayez une heure par semaine ou plusieurs jours à consacrer, votre aide sera précieuse et grandement appréciée. Ensemble, nous pouvons faire une différence significative.",
    "contact_us_about": "Pour plus d'informations sur nos activités, nos événements à venir, ou pour vous inscrire en tant que bénévole, n'hésitez pas à nous contacter. Nous serions ravis de vous accueillir dans notre famille ZD.",
    "contact_title": "Contactez-Nous - No More Wast",
    "contact_intro": "Nous serions ravis d'avoir de vos nouvelles. Que vous ayez des questions sur nos services, souhaitiez devenir bénévole, ou ayez besoin d'aide, n'hésitez pas à nous contacter en utilisant les informations ci-dessous.",
    "contact_details": "Coordonnées",
    "address": "Adresse :",
    "contact_form": "Formulaire de Contact",
    "subject": "Sujet :",
    "message": "Message :",
    "send": "Envoyer",
    "social_media": "Réseaux Sociaux",
    "follow_us": "Suivez-nous sur les réseaux sociaux pour rester informé de nos dernières nouvelles et événements :",
    "office_hours": "Nos Horaires",
    "office_schedule": "Nos bureaux sont ouverts aux horaires suivants :",
    "mon_fri": "Lundi - Vendredi : 9h00 - 18h00",
    "saturday": "Samedi : 10h00 - 14h00",
    "sunday": "Dimanche : Fermé",
    "donate_title": "Faire un Don - No More Wast",
    "why_donate": "Pourquoi Donner ?",
    "donate_intro": "Faire un don à No More Wast contribue directement à améliorer la vie de nombreuses personnes dans notre communauté. Vos dons nous permettent de fournir des repas nutritifs, d'offrir un soutien éducatif, et d'aider les personnes âgées et vulnérables à rester autonomes et connectées.",
    "donate_impact": "Chaque contribution, petite ou grande, fait une différence significative. Grâce à votre générosité, nous pouvons continuer à fournir nos services essentiels et étendre notre portée pour aider encore plus de personnes dans le besoin.",
    "donation_impact": "L'Impact de Votre Don",
    "donate_10": "10 € : Fournit un repas chaud pour une famille de quatre.",
    "donate_20": "20 € : Fournit des fournitures scolaires et un soutien éducatif à un enfant pendant un mois.",
    "donate_50": "50 € : Aide à financer une semaine de visites et de soutien pour une personne âgée isolée.",
    "donate_100": "100 € : Contribue à l'organisation d'un atelier communautaire pour sensibiliser et éduquer sur des sujets importants tels que la nutrition et la santé.",
    "how_to_donate": "Comment Faire un Don",
    "donate_options": "Faire un don à No More Wast est simple et sécurisé. Vous pouvez choisir parmi les options suivantes :",
    "donate_online": "Faire un don en ligne via notre plateforme sécurisée. Cliquez sur le bouton ci-dessous pour commencer :",
    "donate_check": "Envoyer un chèque à l'adresse suivante : 123 Rue de la Solidarité, 75000 Paris, France.",
    "donate_transfer": "Effectuer un virement bancaire. Contactez-nous à donations@zerodechet.fr pour obtenir nos coordonnées bancaires.",
    "donate_button": "Faire un Don en Ligne",
    "donations_in_action": "Vos Dons en Action",
    "support_thanks": "Grâce à votre soutien, No More Wast peut continuer à :",
    "action_food": "Organiser des distributions alimentaires hebdomadaires pour les familles dans le besoin.",
    "action_education": "Fournir un soutien éducatif et des ressources aux enfants pour les aider à réussir à l'école.",
    "action_support": "Offrir des services de compagnonnage et de soutien aux personnes âgées et vulnérables.",
    "action_community": "Créer des programmes communautaires et des ateliers pour renforcer les liens sociaux et améliorer la qualité de vie.",
    "thank_you": "Merci pour Votre Soutien",
    "thank_you_note": "Nous vous remercions chaleureusement pour votre générosité et votre engagement envers notre cause. Ensemble, nous pouvons faire une réelle différence et apporter espoir et soutien à ceux qui en ont le plus besoin.",
    "mission_title": "Nos Missions - No More Wast",
    "introduction": "Introduction",
    "intro_desc": "No More Wast est une organisation engagée à améliorer la qualité de vie des personnes en difficulté à travers divers services et initiatives. Nos missions sont au cœur de notre action, guidant chaque projet et chaque acte de solidarité. Découvrez ci-dessous les principales missions qui animent notre association.",
    "food_aid": "Aide Alimentaire",
    "food_aid_desc": "Nous croyons que tout le monde a le droit à une alimentation saine et équilibrée. Chaque semaine, nous organisons des distributions alimentaires pour les familles et les individus en situation de précarité. Grâce à nos partenariats avec des entreprises locales et des producteurs, nous sommes capables de fournir des repas nutritifs et variés.",
    "volunteer_efforts": "Nos bénévoles dévoués travaillent sans relâche pour collecter, préparer et distribuer ces repas, veillant à ce que personne ne soit privé de nourriture. Cette mission est essentielle pour combattre la faim et la malnutrition dans notre communauté.",
    "educational_support": "Soutien Éducatif",
    "education_key": "L'éducation est la clé d'un avenir meilleur, c'est pourquoi nous fournissons un soutien éducatif aux enfants et aux adolescents. Nos bénévoles qualifiés aident les élèves à surmonter leurs difficultés académiques, les guidant dans leurs études et les aidant à développer des compétences essentielles.",
    "tutoring_sessions": "Que ce soit à travers des séances de tutorat individuelles ou des ateliers collectifs, nous travaillons pour que chaque enfant ait les mêmes chances de succès académique. Cette mission vise à réduire les inégalités éducatives et encourager la persévérance scolaire.",
    "personal_assistance": "Assistance Personnelle",
    "beyond_food_edu": "Au-delà de l'alimentation et de l'éducation, nous nous efforçons de soutenir les personnes âgées et les individus en situation de vulnérabilité. Nos services incluent des visites à domicile, de l'aide pour les courses et un soutien administratif.",
    "maintaining_autonomy": "Ces initiatives sont conçues pour briser l'isolement social et fournir une aide pratique dans la vie quotidienne. Nous croyons en l'importance de maintenir l'autonomie et la dignité de chaque individu, quel que soit sa situation.",
    "community_workshops": "Ateliers et Programmes Communautaires",
    "workshops_description": "Nous organisons régulièrement des ateliers et des programmes communautaires pour sensibiliser et éduquer sur des sujets importants tels que la nutrition, la santé et le bien-être. Ces événements sont ouverts à tous et visent à renforcer les liens sociaux et créer un sentiment de communauté.",
    "learning_opportunities": "Nos ateliers offrent des opportunités d'apprentissage et de partage, permettant à chacun de développer de nouvelles compétences et de s'engager activement dans la vie communautaire. Cette mission est essentielle pour construire une communauté plus forte et plus résiliente.",
    "eco_engagement": "Engagement Écologique",
    "eco_practices": "Nous sommes également engagés à promouvoir des pratiques écologiques et durables. Que ce soit à travers notre approvisionnement alimentaire ou nos ateliers de sensibilisation, nous encourageons des comportements respectueux de l'environnement.",
    "eco_goals": "Notre objectif est de réduire notre empreinte carbone et d'éduquer notre communauté sur l'importance de préserver notre planète. Cette mission écologique est intégrée dans toutes nos actions pour garantir un impact positif à long terme.",
    "join_our_cause": "Si vous partagez notre vision et souhaitez contribuer à nos missions, nous vous invitons à rejoindre notre communauté de bénévoles. Chaque geste compte, et ensemble, nous pouvons accomplir de grandes choses.",
    "get_involved": "Pour plus d'informations sur nos missions ou pour vous impliquer, n'hésitez pas à nous contacter. Nous serions ravis de vous accueillir dans notre famille No More Wast.",

    "day_Sun": "Dim",
    "day_Mon": "Lun",
    "day_Tue": "Mar",
    "day_Wed": "Mer",
    "day_Thu": "Jeu",
    "day_Fri": "Ven",
    "day_Sat": "Sam",
    "database_connection_failed": "Échec de la connexion à la base de données",
    "your_event_calendar": "Votre Calendrier d'Événements",
    "no_events_participation": "Vous ne participez à aucun événement.",
    "type": "Type",
    "location": "Emplacement",
    "start": "Début",
    "end": "Fin",
    "monthly_calendar": "Calendrier Mensuel",

    "title_collecte": "Calculateur d'Itinéraire avec plusieurs arrêts et PDF",
    "route_calculator_title": "Calculateur d'Itinéraire avec plusieurs arrêts",
    "start_address_label": "Adresse de départ :",
    "stop_label": "Arrêt :",
    "remove_stop_button": "Supprimer",
    "add_stop_button": "Ajouter un arrêt",
    "end_address_label": "Adresse d'arrivée :",
    "calculate_route_button": "Calculer l'itinéraire",
    "generate_pdf_button": "Générer le PDF",

    "event_name_placeholder": "Nom de l'événement",
    "event_type_placeholder": "Type d'événement",
    "event_start_placeholder": "Début de l'événement",
    "event_end_placeholder": "Fin de l'événement",
    "location_placeholder": "Lieu",
    "description_placeholder": "Description",
    "create_event_button": "Créer l'événement",
    "error_message": "Une erreur est survenue lors de la création de l'événement.",

    "welcome_message": "Bienvenue, {username}!",
    "username_label": "Nom d'utilisateur",
    "first_name_label": "Prénom",
    "last_name_label": "Nom de famille",
    "email_label": "Email",
    "location_label": "Lieu",
    "phone_label": "Téléphone",
    "password_label": "Nouveau mot de passe (laisser vide pour conserver l'actuel)",
    "edit_button": "Modifier",
    "save_button": "Enregistrer",
    "cancel_button": "Annuler",
    "view_calendar": "Voir le calendrier des événements",

    "name_label": "Prénom",
    "postal_address_label": "Adresse postale",
    "gender_label": "Votre sexe",
    "man_option": "Homme",
    "woman_option": "Femme",
    "register_as_volunteer": "Je souhaite m'inscrire en tant que Bénévole",
    "join_us_button": "Rejoignez-nous",

    "page_title_stock": "Tableau de bord de gestion des stocks d'entrepôt",
    "operation_message": "Opération terminée avec succès.",
    "add_warehouse_title": "Ajouter un Nouvel Entrepôt",
    "location_label_stock": "Emplacement",
    "rack_capacity_label": "Capacité du Rack",
    "add_warehouse_button": "Ajouter l'Entrepôt",
    "capacity_label": "Capacité",
    "current_stock_label": "Stock Actuel",
    "utilization_label": "Utilisation",
    "view_details_link": "Voir les Détails",
    "no_warehouses_message": "Aucun entrepôt disponible.",
    "details_title": "Détails pour l'Entrepôt #",
    "stock_items_title": "Articles en Stock",
    "food_item_column": "Article Alimentaire",
    "quantity_column": "Quantité",
    "unit_column": "Unité",
    "price_per_unit_column": "Prix par Unité",
    "total_value_column": "Valeur Totale",
    "actions_column": "Actions",
    "no_stock_items_message": "Aucun article en stock disponible pour cet entrepôt.",
    "add_item_title": "Ajouter un Nouvel Article Alimentaire",
    "food_type_label": "Type d'Aliment",
    "quantity_label": "Quantité",
    "add_item_button": "Ajouter l'Article",
    "utilization_title": "Utilisation des Stocks de l'Entrepôt",

    "page_title_tickets": "Tickets - ATD",
    "title_label": "Titre",
    "desc_label": "Description",
    "create_ticket_button": "Créer un Ticket",
    "id_column": "ID",
    "title_column": "Titre",
    "status_column": "Statut",
    "open_chat_button": "Ouvrir le Chat",
    "return_button": "Retour aux Tickets",
    "messages_title": "Messages pour le Ticket #",
    "message_placeholder": "Tapez votre message ici...",
    "send_message_button": "Envoyer le Message",

    "page_title": "Entrepôts - ATD",
    "warehouse_details_title": "Détails pour l'Entrepôt #",
    "location_label_warehouses": "Emplacement :",
    "capacity_label_warehouses": "Capacité :",
    "current_stock_label_warehouses": "Stock Actuel :",
    "utilization_label_warehouses": "Utilisation :",
    "all_warehouses_title": "Tous les Entrepôts",
    "location_column": "Emplacement",
    "capacity_column": "Capacité",
    "current_stock_column": "Stock Actuel",
    "utilization_column": "Utilisation",
    "view_details_button": "Voir les Détails"
}
